#+TITLE: 百分之二十三的 Org Mode Bug Report 零回复

# Created: 2018-04-29

Org Mode 不用 Bug Tracker 来管理 Bug（我不明白为什么），所有的 Bug Report 都寄往了邮件列表，我好奇有没有 Bug Report 未被处理？如果有的话，有多少？具体又是哪些？为了有可能回答这个问题，把「未处理的 Bug Report」跟「未收到任何回复的 Bug Report」等价起来。

** 今年四月有多少 Bug Report？

用这个问题来熟悉下 Python 的 mailbox 库。

#+BEGIN_SRC python :results output
  import mailbox
  import os

  file = os.path.expanduser("~/ftp/lists.gnu.org/emacs-orgmode/2018-04")
  mbox = mailbox.mbox(file)

  counter = 0
  for message in mbox:
      subject = message["Subject"]
      if subject.startswith("[O] Bug: "):
          counter += 1
          print(subject.split("\n", 1)[0])
  print("--")
  print("今年四月 Org 共收到了 {} 个 Bug Report".format(counter))
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
[O] Bug: org-capture files wrong date in capture template [9.1.7
[O] Bug: CUSTOM_ID property not used in LaTeX-Export [9.1.9
[O] Bug: Modifying org-latex-pdf-process doesn't modify the async
[O] Bug: 'M-x org-tags-view c-g' not exit gracefully [9.1.9
[O] Bug: Prevent fill-paragraph from breaking inside Org mode links
[O] Bug: Editing <column-width> cookie in table column breaks
[O] Bug: Usage of pmatrix yields error message dispite lack of
[O] Bug: Weird interaction between ox-extra and include :minlevel
[O] Bug: org-capture template expansion "%x" stopped working
[O] Bug: org-collector evaluates headlines starting with hyperlink
[O] Bug: org-agenda no more aligns tags to the set column
[O] Bug: A typo in org-eww-copy-for-org-mode's docstring [9.1.11
[O] Bug: Usability for tags in master branch [9.1.12
[O] Bug: org-agenda-tags-column does not work anymore [9.1.12
--
今年四月 Org 共收到了 14 个 Bug Report
#+END_EXAMPLE

** 今年四月有多少没有回复 Bug Report？

把这个问题解决了，应该就能容易地解决最终的问题了。

#+BEGIN_SRC python :results output
  import mailbox
  import os

  file = os.path.expanduser("~/ftp/lists.gnu.org/emacs-orgmode/2018-04")

  def get_bugs(file):
      """从 mobx 文件中获得所有的 Bug Report 消息"""
      bugs = []
      mbox = mailbox.mbox(file)
      for message in mbox:
          subject = message["Subject"]
          if subject.startswith("[O] Bug: "):
              bugs.append(message)
      return bugs

  bugs = get_bugs(file)
  mbox = mailbox.mbox(file)
  for bug in bugs:
      message_id = bug["Message-ID"]
      for msg in mbox:
          reply_id = msg.get("In-Reply-To", None)
          if reply_id and reply_id.startswith(message_id):
              bug["Replied"] = True
              break

  replied_bugs = []
  unreplied_bugs = []
  for bug in bugs:
      if bug.get("Replied"):
          replied_bugs.append(bug)
      else:
          unreplied_bugs.append(bug)

  print("Total Bugs:", len(bugs))
  print("Replied Bugs:", len(replied_bugs))
  print("Unreplied Bugs:", len(unreplied_bugs))

  for bug in unreplied_bugs:
      print(bug["Subject"].split("\n", 1)[0])
#+END_SRC

#+RESULTS:
: Total Bugs: 14
: Replied Bugs: 11
: Unreplied Bugs: 3
: [O] Bug: 'M-x org-tags-view c-g' not exit gracefully [9.1.9
: [O] Bug: Usage of pmatrix yields error message dispite lack of
: [O] Bug: org-collector evaluates headlines starting with hyperlink

四月报告的 14 个 Bug 中有 3 个未处理。

